#+title: Ps 04
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-04-22>
#+lastmod: <2026-04-23 16:25>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

*** Numerical check

For $n = 10$, $m = 3$: $\Pr[S = T] = \frac{3!\,7!}{10!} = \frac{1}{\binom{10}{3}} = \frac{1}{120} \approx 0.00833$.

#+begin_src julia :results value
using Random
let
    n, m = 10, 3
    target = Set(1:m)               # fix an arbitrary 3-subset
    epochs = 1_000_000
    hits = 0
    for _ in 1:epochs
        sample = Set(shuffle(1:n)[1:m])
        hits += (sample == target)
    end
    hits / epochs                   # should be ≈ 1/120 ≈ 0.00833
end
#+end_src

#+RESULTS:
: 0.008319

*** (b)

No. $A[4] = 15$ but $A[9] = 16$, violating $A[i] \geq A[2i+1]$.

#+begin_src julia :results output
let
    arr = [33, 19, 20, 15, 13, 10, 2, 13, 16, 12]
    n = length(arr)
    ok = true
    for i in 1:div(n, 2)
        if arr[i] < arr[2i] || (2i+1 ≤ n && arr[i] < arr[2i+1])
            ok = false
            break
        end
    end
    println(ok ? "max-heap" : "not max-heap")
end
#+end_src

#+RESULTS:
: not max-heap
